sudo-kachponz/robotku/firmware/robotku-esp32/src/main.cpp
/* ============================================================================
 * Robotku ESP32 Firmware — resident command interpreter (Joystick + 6 blocks)
 * ----------------------------------------------------------------------------
 * Speaks the SAME line-delimited JSON protocol as the Robotku web app, over BOTH:
 *   - BLE Nordic UART Service (NUS)   -> Web Bluetooth
 *   - USB Serial @ 115200             -> Web Serial
 * The web app STREAMS commands; we interpret them live. No compile/flash on Run.
 *
 * SCOPE (deliberately narrow — prove the pipe end-to-end first):
 *   Joystick  : SET_PORT
 *   Block set : MOVE_TIMED, TURN_TIMED, WAIT, PLAY_TONE, STOP_ALL
 *   Everything else -> {"command":"UNSUPPORTED","op":"..."};
 *
 * A bench operator can ALSO type ControllerV1-style text commands into the Serial
 * Monitor (cw / ccw / stop / help / a bare 0-180 angle) — see handleTextCommand().
 * That path is purely additive; the JSON path is untouched.
 *
 * Layout: this file is src/main.cpp with src/config.h beside it, so both
 * PlatformIO (default src_dir) and the Arduino IDE (which compiles the sketch's
 * src/ tree) build it. robotku-esp32.ino in the parent folder is an empty stub
 * that exists only to give the Arduino IDE a sketch name. See README.
 *
 * Two wire shapes both accepted (see FIX 2):
 *   flat   {"command":"SET_PORT","port":1,"value":80};                 (Joystick)
 *   nested {"command":"MOVE_TIMED","params":{"direction":"backward",   (Blocks)
 *           "speed":40,"duration_ms":2000}};
 *
 * Hardware is proven on bench test1 — see config.h. Drive is TWO continuous SG90
 * servos (tank style), NOT an H-bridge; buzzer on GPIO13; SSD1306 OLED on I2C.
 *
 * Pinned libraries (see platformio.ini / README):
 *   NimBLE-Arduino, ArduinoJson 7, ESP32Servo, Adafruit_SSD1306, Adafruit_GFX.
 * ==========================================================================*/

#include <NimBLEDevice.h>
#include <ArduinoJson.h>          // v7 — JsonDocument (StaticJsonDocument is deprecated)
#include <ESP32Servo.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>

#include "config.h"

// ------------------------------------------------------------------ Identity
#define FW_VERSION   "2.0.0-joy6"
#define BOARD_NAME   "Robotku ESP32"
#define PROTOCOL_ID  "robotku-v1"
#define BLE_NAME     "Robotku"

// -------------------------------------------------------------- NUS UUIDs
// MUST match src/transport/BleTransport.ts exactly — do NOT change these.
#define NUS_SERVICE_UUID  "6e400001-b5a3-f393-e0a9-e50e24dcca9e"
#define NUS_RX_CHAR_UUID  "6e400002-b5a3-f393-e0a9-e50e24dcca9e"  // web writes here
#define NUS_TX_CHAR_UUID  "6e400003-b5a3-f393-e0a9-e50e24dcca9e"  // we notify here

// =============================================================== HARDWARE
Servo servoL;
Servo servoR;
Servo servoAux;       // accessory positional servo on P5 (config.h)
ESP32PWM buzzerPwm;   // buzzer via the SAME allocator as the servos -> its own timer
                      // (Arduino tone() stole a servo's timer, making the servo "sing")
unsigned long buzzerOffMs = 0;   // 0 = silent; else stop the tone at this millis()
Adafruit_SSD1306 oled(OLED_WIDTH, OLED_HEIGHT, &Wire, -1);
bool oledOk = false;

// ----------------------------------------------------- Non-blocking motion
// FIX 3: the firmware NEVER blocks. A timed command sets the actuators and
// records a deadline; loop() stops them when the deadline passes. delay() must
// not appear on the command path or (a) BLE bytes pile up and (b) HEARTBEAT is
// missed and the watchdog kills a move longer than the timeout. The browser is
// the real timekeeper; this deadline is only a safety net if a STOP is lost.
// Do NOT "simplify" this back into delay() — that reintroduces both bugs.
unsigned long motionEndsAtMs = 0;   // 0 = no timed motion in flight

// ----------------------------------------------------- Heartbeat watchdog
// FIX 6: arm ONLY after the first HELLO (a bare board on the bench must idle,
// not failsafe every second). Disarm on BLE disconnect. Trip if the link goes
// quiet for HEARTBEAT_TIMEOUT_MS.
unsigned long lastRxMs = 0;
bool watchdogArmed = false;
bool failsafeEngaged = false;

// --------------------------------------------------------------- BLE state
NimBLECharacteristic* txChar = nullptr;
bool bleConnected = false;
uint16_t bleMtu = 23;               // updated on negotiation (FIX 5); 23 = BLE default

// Inbound line buffers (one per interface; both feed the same parser).
String bleBuffer = "";
String serialBuffer = "";

String lastStatus = "Siap";         // shown on OLED

// ------------------------------------------------------- Interface presence
// USB Serial gives us no connect/disconnect event, so "USB" means "we have seen
// at least one line arrive over it". BLE we know exactly. Drives the OLED's
// connection line: "BLE" > "USB" > "Terputus".
bool usbSeen = false;

// ------------------------------------------------------------- Servo mirror
// Last angle actually written per channel, so the OLED can show the true servo
// position (ControllerV1 does this and it is far more useful on the bench than a
// generic status string). Index 0 = left, 1 = right.
// Index 0=left drive, 1=right drive, 2=aux positional. Aux centres at 90.
int servoAngle[3] = { SERVO_STOP_DEG, SERVO_STOP_DEG, 90 };

// Is the ESP32Servo currently emitting pulses on this channel? A DETACHED channel
// sends no signal at all, so a continuous SG90 truly stops instead of creeping at
// "90". We attach lazily (first real drive) and detach at idle / on "cabut", so
// "not driving" == "physically cut" — what the virtual schematic promises.
bool servoHwAttached[3] = { false, false, false };
// Schematic module present? The web's pasang/cabut toggles this. A cut channel
// refuses to drive until it is attached again ("kecuali disambungin lagi").
bool servoModulePresent[3] = { true, true, true };

// ---------------------------------------------------------- OLED throttling
// An SSD1306 refresh is ~30 ms over I2C. Rendering on every command would
// throttle the command stream itself (Joystick sends continuously), so frames
// are marked dirty and pushed at most every OLED_MIN_PUSH_INTERVAL_MS from loop().
String oledLine1 = "Siap";
String oledLine2 = "USB / Bluetooth";
bool oledDirty = false;
unsigned long lastOledPushMs = 0;

// DISPLAY_BITMAP: a coarse pixel-art grid (from the web editor) scaled to fill the
// 128x64 panel. Stored as a '0'/'1' string, row-major, w*h chars. bitmapMode routes
// oledRender() to draw pixels instead of the status layout; any status change clears it.
String oledBmp = "";
int oledBmpW = 0;
int oledBmpH = 0;
bool oledBitmapMode = false;

// ============================================================ ACTUATOR API
// Where "stopped" actually is for a channel, once trim is applied.
int servoNeutralDeg(int ch) {
  if (ch == 2) return 90;   // aux is positional — centre, no continuous-servo trim
  return SERVO_STOP_DEG + (ch == 0 ? SERVO_L_TRIM : SERVO_R_TRIM);
}

