sudo-kachponz/robotku/firmware/robotku-esp32/src/main.cpp
// Pin + Servo object for a channel, so the switch lives in ONE place.
int servoPin(int ch) {
  return (ch == 0) ? PIN_SERVO_L : (ch == 1) ? PIN_SERVO_R : PIN_SERVO_AUX;
}
Servo* servoObj(int ch) {
  return (ch == 0) ? &servoL : (ch == 1) ? &servoR : &servoAux;
}
// This channel physically exists on this board?
bool servoChannelWired(int ch) {
  if (ch == 0) return true;
  if (ch == 1) return HAS_SERVO_R;
  if (ch == 2) return HAS_SERVO_AUX;
  return false;
}

// Attach or detach the ESP32Servo for a channel — ONLY on a real transition
// (calling attach() every frame glitches the pulse train). Detach parks the pin
// LOW so it can't float and twitch: the signal is genuinely gone, not just "90".
void servoSetAttached(int ch, bool want) {
  if (ch < 0 || ch > 2 || !servoChannelWired(ch)) return;
  if (want == servoHwAttached[ch]) return;
  Servo* s = servoObj(ch);
  int pin = servoPin(ch);
  if (want) {
    s->setPeriodHertz(50);
    s->attach(pin, SERVO_MIN_US, SERVO_MAX_US);
  } else {
    s->detach();
    pinMode(pin, OUTPUT);
    digitalWrite(pin, LOW);
  }
  servoHwAttached[ch] = want;
}

// The ONE place a servo angle is written. Both the JSON path (driveChannel) and
// the bench text path (a bare 0-180) go through here, so the OLED mirror and the
// unwired-channel guard can't drift apart.
void servoWriteAngle(int ch, int deg) {
  if (ch < 0 || ch > 2 || !servoChannelWired(ch)) return;   // no such servo here
  if (!servoModulePresent[ch]) return;   // cut in the schematic — refuse to drive
  servoSetAttached(ch, true);            // writing an angle means we ARE driving
  deg = constrain(deg, 0, 180);
  servoObj(ch)->write(deg);
  servoAngle[ch] = deg;
  oledDirty = true;                      // pushed by loop(), throttled
}

// STOP / CW / CCW for a channel, derived from the angle actually written
// relative to that channel's trimmed neutral — no extra state to keep in sync.
const char* servoDirLabel(int ch) {
  int d = servoAngle[ch] - servoNeutralDeg(ch);
  if (d > 2)  return "CW";
  if (d < -2) return "CCW";
  return "STOP";
}

// One continuous-servo channel. value in [-100,100]: + = forward for that side
// AFTER invert is applied, 0 = stop (with trim), - = reverse.
void driveChannel(int ch, int value) {
  if (ch < 0 || ch > 2 || !servoChannelWired(ch)) return;
  value = constrain(value, -100, 100);

  // Cut in the schematic: go silent regardless of channel type.
  if (!servoModulePresent[ch]) {
    servoSetAttached(ch, false);
    servoAngle[ch] = servoNeutralDeg(ch);
    oledDirty = true;
    return;
  }

  // Aux (positional): value -100..100 -> 0..180 deg, HELD (0 = centre, not cut).
  if (ch == 2) {
    servoWriteAngle(2, 90 + (value * 90) / 100);
    return;
  }

  // Continuous drive (0/1): idle within the deadband cuts the pulses entirely.
  // No signal -> a continuous servo actually STOPS; one held at "90" creeps.
  if (abs(value) < SERVO_DEADBAND) {
    servoSetAttached(ch, false);
    servoAngle[ch] = servoNeutralDeg(ch);   // OLED reads STOP
    oledDirty = true;
    return;
  }

  int trim   = (ch == 0) ? SERVO_L_TRIM : SERVO_R_TRIM;
  bool invert = (ch == 0) ? false : (SERVO_R_INVERT != 0);
  int eff = invert ? -value : value;
  // Continuous SG90: 90 = stop, ±90 span. Trim nudges the neutral point.
  servoWriteAngle(ch, SERVO_STOP_DEG + trim + (eff * 90) / 100);
}

// Tank drive: left/right in [-100,100], + = forward.
void driveTank(int left, int right) {
  driveChannel(0, left);
  driveChannel(1, right);
}

// STOP_ALL / failsafe / deadline: every channel to neutral, cancel any deadline.
void stopAllActuators() {
  driveChannel(0, 0);
  driveChannel(1, 0);
  motionEndsAtMs = 0;
}

// RGB LED (FW-06). Digital 8-color (any mix of R/G/B) — PWM stutters servo 2 on this
// board, so on/off keeps both servos smooth. r/g/b are 0..255; >127 = "on".
void setLedColor(int r, int g, int b) {
#if HAS_RGB
  digitalWrite(PIN_LED_R, r > 127 ? HIGH : LOW);
  digitalWrite(PIN_LED_G, g > 127 ? HIGH : LOW);
  digitalWrite(PIN_LED_B, b > 127 ? HIGH : LOW);
#else
  (void)r; (void)g; (void)b;
#endif
}

// =============================================================== OLED
// "BLE" | "USB" | "Terputus" — what the board is actually talking to.
const char* connLabel() {
  if (bleConnected) return "BLE";
  if (usbSeen)      return "USB";
  return "Terputus";
}

// Build the frame and push it. Callers go through oledPushIfDue(), never here.
void oledRender() {
  oled.clearDisplay();
  oled.setTextColor(SSD1306_WHITE);

  // Pixel-art bitmap mode: scale the w x h grid to fill the panel and bail early.
  if (oledBitmapMode && oledBmpW > 0 && oledBmpH > 0) {
    int cw = OLED_WIDTH / oledBmpW;
    int ch = OLED_HEIGHT / oledBmpH;
    for (int r = 0; r < oledBmpH; r++) {
      for (int c = 0; c < oledBmpW; c++) {
        if (oledBmp[r * oledBmpW + c] == '1') oled.fillRect(c * cw, r * ch, cw, ch, SSD1306_WHITE);
      }
    }
    oled.display();
    return;
  }

  // Row 1: brand + which link we are on.
  oled.setTextSize(1);
  oled.setCursor(0, 0);
  oled.print(F("Robotku"));
  const char* conn = connLabel();
  oled.setCursor(128 - 6 * (int)strlen(conn), 0);   // right-aligned, 6px/char
  oled.print(conn);

  // Row 2: the headline status, big enough to read from across the table.
  oled.setTextSize(2);
  oled.setCursor(0, 12);
  oled.print(oledLine1);

  // Row 3: real servo position + direction, per channel (ControllerV1 style).
  oled.setTextSize(1);
  oled.setCursor(0, 32);
  char buf[24];
  if (HAS_SERVO_R) {
    snprintf(buf, sizeof(buf), "L%3d %-4s R%3d %s",
             servoAngle[0], servoDirLabel(0), servoAngle[1], servoDirLabel(1));
  } else {
    // Honest about the hardware: no second servo, so no second reading.
    snprintf(buf, sizeof(buf), "L%3d %-4s R  --", servoAngle[0], servoDirLabel(0));
  }
  oled.print(buf);

  // Row 4: detail line.
  oled.setCursor(0, 46);
  oled.print(oledLine2);

  oled.display();
}

// Push a pending frame if the display has had its ~30 ms to breathe. Called from
// loop() and opportunistically right after a status change so single events
// (HELLO, STOP) appear immediately instead of waiting for the next tick.
void oledPushIfDue() {
  if (!oledOk || !oledDirty) return;
  unsigned long now = millis();
  if (now - lastOledPushMs < OLED_MIN_PUSH_INTERVAL_MS) return;
  lastOledPushMs = now;
  oledDirty = false;
  oledRender();
}

