sudo-kachponz/robotku/firmware/robotku-esp32/src/main.cpp
void oledStatus(const String& line1, const String& line2) {
  oledLine1 = line1;
  oledLine2 = line2;
  oledBitmapMode = false; // a status update takes the panel back from bitmap mode
  oledDirty = true;
  oledPushIfDue();
}

void oledSplash() {
  if (!oledOk) return;
  oled.clearDisplay();
  // Simple friendly robot face — the "robot is alive" cue for kids.
  oled.drawRoundRect(34, 8, 60, 40, 8, SSD1306_WHITE);   // head
  oled.fillCircle(52, 26, 5, SSD1306_WHITE);             // left eye
  oled.fillCircle(76, 26, 5, SSD1306_WHITE);             // right eye
  oled.drawLine(54, 40, 74, 40, SSD1306_WHITE);          // smile
  oled.drawLine(64, 2, 64, 8, SSD1306_WHITE);            // antenna
  oled.fillCircle(64, 2, 2, SSD1306_WHITE);
  oled.setTextSize(1);
  oled.setTextColor(SSD1306_WHITE);
  oled.setCursor(40, 54);
  oled.println(F("ROBOTKU"));
  oled.display();
}

// Startup chirp — happens in setup(), so delay() here is fine (not the cmd path).
// Buzzer via ESP32PWM (own timer, coordinated with servos). ms<=0 = play until the
// next call; else loop() silences it at the deadline. Replaces Arduino tone(), whose
// LEDC channel clashed with a servo timer (servo hummed the melody).
void buzzerTone(int freq, long ms) {
  buzzerPwm.writeTone(freq);
  buzzerOffMs = (ms > 0) ? (millis() + ms) : 0;
}
void buzzerOff() {
  buzzerPwm.write(0);   // duty 0 = silent
  buzzerOffMs = 0;
}

void startupTone() {
  buzzerTone(880, 0);  delay(140);
  buzzerTone(1175, 0); delay(140);
  buzzerTone(1568, 0); delay(180);
  buzzerOff();
}

// =============================================================== TELEMETRY
// FIX 5: chunk notifications by the NEGOTIATED MTU (minus the 3-byte ATT header),
// not a fixed 180. The web reassembles across notifications by buffering until a
// ';', so a mid-line split is safe; we just must not exceed the MTU or the stack
// silently drops the tail and the JSON arrives corrupt.
void sendTelemetry(const String& line) {
  if (bleConnected && txChar) {
    size_t maxChunk = (bleMtu > 3) ? (size_t)(bleMtu - 3) : 20;
    for (size_t i = 0; i < line.length(); i += maxChunk) {
      String chunk = line.substring(i, i + maxChunk);
      txChar->setValue((uint8_t*)chunk.c_str(), chunk.length());
      txChar->notify();
    }
  }
  Serial.print(line);   // mirror to USB serial
}

void sendJson(JsonDocument& doc) {
  String out;
  serializeJson(doc, out);
  out += ";";           // the web parser splits on ';' — always terminate
  sendTelemetry(out);
}

void sendUnsupported(const char* op) {
  JsonDocument d;
  d["command"] = "UNSUPPORTED";
  d["op"] = op;
  sendJson(d);
}

// ---------------------------------------------------- param helpers (FIX 2)
// Duration may arrive as duration_ms | ms | duration (isNull() == key absent).
long readDurationMs(JsonObjectConst p) {
  if (!p["duration_ms"].isNull()) return p["duration_ms"].as<long>();
  if (!p["ms"].isNull())          return p["ms"].as<long>();
  if (!p["duration"].isNull())    return p["duration"].as<long>();
  return 0;
}

// A tiny note-name -> frequency map so PLAY_TONE accepts {"note":"C4"} too.
int noteToFreq(const char* note) {
  struct N { const char* n; int f; };
  static const N tbl[] = {
    {"C4",262},{"D4",294},{"E4",330},{"F4",349},{"G4",392},{"A4",440},{"B4",494},
    {"C5",523},{"D5",587},{"E5",659},{"F5",698},{"G5",784},{"A5",880}
  };
  for (auto& e : tbl) if (strcasecmp(e.n, note) == 0) return e.f;
  return 440;
}

// =========================================================== COMMAND PARSER
void handleCommand(const String& jsonLine) {
  JsonDocument doc;
  if (deserializeJson(doc, jsonLine)) return;   // ignore malformed fragment

  const char* cmd = doc["command"] | "";
  if (cmd[0] == '\0') return;

  // FIX 2 — nested-or-flat shim. Read EVERY parameter through `p`. Block Coding
  // sends {command, params:{...}}; Joystick/bench send flat {command, port,...}.
  // Supporting both means a later web change never forces re-flashing every board.
  JsonObjectConst p = doc["params"].is<JsonObject>() ? doc["params"].as<JsonObjectConst>()
                                                     : doc.as<JsonObjectConst>();

  // Any inbound, well-formed command counts as "link alive".
  lastRxMs = millis();
  failsafeEngaged = false;

  // --- STOP_ALL — safety first, handled before anything else ---------------
  if (strcmp(cmd, "STOP_ALL") == 0) {
    stopAllActuators();
    lastStatus = "STOP";
    return;
  }

  // --- System / handshake --------------------------------------------------
  if (strcmp(cmd, "HELLO") == 0) {
    // FIX 7 — advertise ONLY what actually compiles here.
    JsonDocument ack;
    ack["command"]  = "HELLO_ACK";
    ack["fw"]       = FW_VERSION;
    ack["board"]    = BOARD_NAME;
    ack["protocol"] = PROTOCOL_ID;
    JsonArray caps = ack["capabilities"].to<JsonArray>();
    caps.add("SET_PORT");
    caps.add("ATTACH");
    caps.add("DETACH");
#if HAS_SERVO_AUX
    caps.add("SET_HEAD_POSITION");   // accessory positional servo on P5
#endif
    caps.add("STOP_ALL");
    caps.add("STOP");
    caps.add("MOVE_TIMED");
    // Turning needs two independently driven sides. With HAS_SERVO_R = 0 there
    // is only one, so don't advertise it — see the ports scan below.
    if (HAS_SERVO_R) caps.add("TURN_TIMED");
    if (HAS_SERVO_R) caps.add("STEER_TIMED");
    caps.add("WAIT");
    caps.add("PLAY_TONE");
#if HAS_RGB
    caps.add("SET_LED_COLOR");   // FW-06 RGB LED (GPIO16/17/5)
#endif
    if (oledOk) caps.add("DISPLAY_TEXT");   // OLED text — only if the panel answered
    if (oledOk) caps.add("DISPLAY_BITMAP"); // OLED pixel-art
    if (oledOk) caps.add("SET_LED_BRIGHTNESS"); // OLED contrast/brightness
    // Report the ports that are REALLY wired by scanning the config.h table —
    // never a hardcoded list. A board claiming port 2 it doesn't have makes the
    // right joystick axis die silently, which reads as "the web app is broken".
    JsonArray ports = ack["ports"].to<JsonArray>();
    for (int i = 1; i <= 8; i++) {
      if (PORT_CHANNEL[i] >= 0) ports.add(i);
    }
    ack["driveMode"] = "servo";
    ack["hasBuzzer"] = true;
    ack["hasOled"]   = oledOk;                  // real I2C detection (0x3C), not a claim
    ack["hasRgbLed"] = (bool)HAS_RGB;
    ack["boardId"]   = "esp32-controller-v3";
    // Modules actually detected on the bus so the web can enable their blocks.
    if (oledOk) {
      JsonArray periph = ack["peripherals"].to<JsonArray>();
      periph.add("oled-ssd1306");
    }
    sendJson(ack);
    watchdogArmed = true;         // the link is live from here on
    lastStatus = "Terhubung";
    oledStatus("Terhubung", bleConnected ? "via Bluetooth" : "via USB");
    return;
  }

  if (strcmp(cmd, "HEARTBEAT") == 0) {
    JsonDocument ack;
    ack["command"] = "ACK";
    ack["seq"] = doc["seq"] | 0;
    sendJson(ack);
    return;
  }

