sudo-kachponz/robotku/firmware/robotku-esp32/src/main.cpp
// --- Joystick ------------------------------------------------------------
  // SET_PORT is LIVE control: no deadline (the joystick keeps sending; the
  // watchdog is the safety net). Map the port through the config.h table.
  if (strcmp(cmd, "SET_PORT") == 0) {
    int port  = p["port"]  | 0;
    int value = p["value"] | 0;
    if (port < 1 || port > 8 || PORT_CHANNEL[port] < 0) {
      sendUnsupported("SET_PORT");   // unwired port — never silent (FIX 4)
      return;
    }
    driveChannel(PORT_CHANNEL[port], value);
    return;
  }

  // --- Block: Forward / Reverse -------------------------------------------
  if (strcmp(cmd, "MOVE_TIMED") == 0) {
    const char* dir = p["direction"] | "forward";
    int speed = constrain((int)(p["speed"] | 60), 0, 100);
    long ms   = readDurationMs(p);
    int sign  = (strcmp(dir, "backward") == 0) ? -1 : 1;   // must read direction (FIX 2)
    driveTank(sign * speed, sign * speed);
    if (ms > 0) motionEndsAtMs = millis() + ms + MOTION_SAFETY_MARGIN_MS;
    lastStatus = (sign > 0) ? "Maju" : "Mundur";
    return;
  }

  // --- Block: Left / Right -------------------------------------------------
  if (strcmp(cmd, "TURN_TIMED") == 0) {
    if (!HAS_SERVO_R) {
      // One driven side can't turn — it would just drive straight. Say so
      // instead of moving wrongly and silently (FIX 4).
      sendUnsupported("TURN_TIMED");
      return;
    }
    const char* dir = p["direction"] | "left";
    int speed = constrain((int)(p["speed"] | 60), 0, 100);
    long ms   = readDurationMs(p);
    // left = left side back + right side forward; right = the mirror.
    bool left = (strcmp(dir, "left") == 0);
    driveTank(left ? -speed : speed, left ? speed : -speed);
    if (ms > 0) motionEndsAtMs = millis() + ms + MOTION_SAFETY_MARGIN_MS;
    lastStatus = left ? "Kiri" : "Kanan";
    return;
  }

  // --- Block: Stop (wheels) ------------------------------------------------
  if (strcmp(cmd, "STOP") == 0) {
    driveTank(0, 0);          // halt the drive servos; leave buzzer/LED alone
    motionEndsAtMs = 0;
    lastStatus = "Stop";
    return;
  }

  // --- Block: Steer (differential) ----------------------------------------
  if (strcmp(cmd, "STEER_TIMED") == 0) {
    if (!HAS_SERVO_R) { sendUnsupported("STEER_TIMED"); return; }  // needs two sides
    int speed    = constrain((int)(p["speed"] | 60), 0, 100);
    int steering = constrain((int)(p["steering"] | 0), -100, 100);
    long ms      = readDurationMs(p);
    float turn = steering / 100.0f;                                // -1..1
    int lspeed = constrain((int)(speed * (1.0f + turn)), -100, 100);
    int rspeed = constrain((int)(speed * (1.0f - turn)), -100, 100);
    driveTank(lspeed, rspeed);
    if (ms > 0) motionEndsAtMs = millis() + ms + MOTION_SAFETY_MARGIN_MS;
    lastStatus = "Belok";
    return;
  }

  // --- Block: Wait ---------------------------------------------------------
  // Non-blocking no-op: the browser owns sequencing. We ACK so it's clear the
  // command arrived (and so the link stays "alive" — handled above).
  if (strcmp(cmd, "WAIT") == 0) {
    JsonDocument ack;
    ack["command"] = "ACK";
    ack["op"] = "WAIT";
    sendJson(ack);
    return;
  }

  // --- Block: Play Tone ----------------------------------------------------
  if (strcmp(cmd, "PLAY_TONE") == 0) {
    int freq;
    if (!p["frequency"].isNull())  freq = p["frequency"].as<int>();
    else if (!p["note"].isNull())  freq = noteToFreq(p["note"].as<const char*>());
    else                           freq = 440;
    long ms = readDurationMs(p);
    if (ms <= 0) ms = 300;
    buzzerTone(freq, ms);   // non-blocking; loop() silences at the deadline
    lastStatus = "Nada";
    return;
  }

  // --- Block: RGB LED color (FW-06) ---------------------------------------
  if (strcmp(cmd, "SET_LED_COLOR") == 0) {
#if HAS_RGB
    setLedColor(p["r"] | 0, p["g"] | 0, p["b"] | 0);
#else
    sendUnsupported("SET_LED_COLOR");   // no RGB LED on this board (FIX 4)
#endif
    return;
  }

  // --- Block: OLED text — give the screen a name/words --------------------
  if (strcmp(cmd, "DISPLAY_TEXT") == 0) {
    if (oledOk) {
      oledStatus(p["text"] | "", "");   // headline line; reuses the throttled render
    } else {
      sendUnsupported("DISPLAY_TEXT");   // OLED not detected (FIX 4)
    }
    return;
  }

  // --- Block: OLED brightness (SSD1306 contrast) --------------------------
  // The RGB LED is digital and can't dim, so this drives the ONE dimmable display:
  // the OLED's contrast register (0..255 mapped from 0..100%).
  if (strcmp(cmd, "SET_LED_BRIGHTNESS") == 0) {
    if (!oledOk) { sendUnsupported("SET_LED_BRIGHTNESS"); return; }
    int pct = constrain((int)(p["value"] | 100), 0, 100);
    oled.ssd1306_command(SSD1306_SETCONTRAST);
    oled.ssd1306_command((uint8_t)(pct * 255 / 100));
    lastStatus = "Terang";
    return;
  }

  // --- OLED pixel-art bitmap (from the web pixel editor) -------------------
  if (strcmp(cmd, "DISPLAY_BITMAP") == 0) {
    if (!oledOk) { sendUnsupported("DISPLAY_BITMAP"); return; }
    int w = p["w"] | 0;
    int h = p["h"] | 0;
    const char* px = p["pixels"] | "";
    if (w > 0 && h > 0 && w <= OLED_WIDTH && h <= OLED_HEIGHT && (int)strlen(px) >= w * h) {
      oledBmpW = w;
      oledBmpH = h;
      oledBmp = px;
      oledBitmapMode = true;
      oledDirty = true;
      oledPushIfDue();
    }
    return;
  }

  // --- Anything else -------------------------------------------------------
  // FIX 4: never silent. The old "ignore unknown command" line is exactly why
  // Joystick failed without a trace.
  sendUnsupported(cmd);
}

// ==================================================== TEXT COMMAND FALLBACK
// The web app only ever speaks JSON. Typing JSON by hand into a Serial Monitor is
// miserable, so a bench operator also gets the ControllerV1 vocabulary:
//
//   cw [ms]   ccw [ms]   stop   help   <angka 0-180>
//
// PURELY ADDITIVE — the JSON path above is untouched. This reuses driveChannel() /
// servoWriteAngle() and the SAME non-blocking motionEndsAtMs deadline that loop()
// already enforces; there is no second timer to keep in sync. Replies use
// ControllerV1's [OK]/[ERROR] prefixes and go to USB Serial only: they are not
// JSON, and the web's telemetry parser silently drops non-JSON frames anyway.

void textReply(const char* msg) {
  Serial.print(msg);
  Serial.print('\n');
}

