sudo-kachponz/robotku/firmware/robotku-esp32/src/main.cpp
void textHelp() {
  textReply("[OK] perintah teks (selain JSON):");
  textReply("  cw [ms]   - putar arah + (kosongkan ms = sampai stop)");
  textReply("  ccw [ms]  - putar arah -");
  textReply("  stop      - hentikan semua, batalkan tenggat");
  textReply("  0-180     - tulis sudut servo langsung");
  textReply("  help      - tampilkan daftar ini");
  textReply("[OK] JSON tetap jalan, mis: {\"command\":\"STOP_ALL\"};");
}

bool isAllDigits(const String& t) {
  if (t.length() == 0) return false;
  for (unsigned int i = 0; i < t.length(); i++) {
    if (!isDigit(t[i])) return false;
  }
  return true;
}

void handleTextCommand(const String& raw) {
  String line = raw;
  line.replace('\t', ' ');           // some Serial Monitors send tabs
  line.trim();
  if (line.length() == 0) return;

  int sp = line.indexOf(' ');
  String verb = (sp < 0) ? line : line.substring(0, sp);
  String arg  = (sp < 0) ? String("") : line.substring(sp + 1);
  verb.toLowerCase();
  arg.trim();

  if (verb == "help" || verb == "?") {
    textHelp();
    return;
  }

  if (verb == "stop") {
    stopAllActuators();               // also clears motionEndsAtMs
    lastStatus = "STOP";
    oledStatus("STOP", "perintah teks");
    textReply("[OK] stop");
    return;
  }

  if (verb == "cw" || verb == "ccw") {
    if (arg.length() > 0 && !isAllDigits(arg)) {
      textReply("[ERROR] ms harus angka, mis: cw 2000");
      return;
    }
    long ms = (arg.length() > 0) ? arg.toInt() : 0;
    bool cw = (verb == "cw");
    // "cw" = the same direction a POSITIVE SET_PORT drives the left channel, so
    // bench and web agree. The right channel keeps its SERVO_R_INVERT mirroring.
    int value = cw ? 100 : -100;
    driveChannel(0, value);
    if (HAS_SERVO_R) driveChannel(1, value);
    // Same deadline field the JSON path uses. No MOTION_SAFETY_MARGIN_MS here:
    // on the bench there is no browser acting as timekeeper, so the ms typed IS
    // the duration. ms omitted / 0 -> run until an explicit `stop`.
    motionEndsAtMs = (ms > 0) ? (millis() + (unsigned long)ms) : 0;
    lastStatus = cw ? "CW" : "CCW";

    char detail[24];
    if (ms > 0) snprintf(detail, sizeof(detail), "%ld ms", ms);
    else        snprintf(detail, sizeof(detail), "sampai stop");
    oledStatus(lastStatus, detail);

    char ok[48];
    snprintf(ok, sizeof(ok), "[OK] %s %s", cw ? "cw" : "ccw", detail);
    textReply(ok);
    return;
  }

  // A bare number: write the angle straight through, ControllerV1 style. Useful
  // for finding a continuous servo's true neutral before setting SERVO_*_TRIM.
  if (isAllDigits(line)) {
    int deg = line.toInt();
    if (deg > 180) {
      textReply("[ERROR] sudut harus 0-180");
      return;
    }
    motionEndsAtMs = 0;               // a held angle has no deadline
    servoWriteAngle(0, deg);
    if (HAS_SERVO_R) servoWriteAngle(1, deg);
    lastStatus = "Sudut";

    char detail[24];
    snprintf(detail, sizeof(detail), "%d deg", deg);
    oledStatus("Sudut", detail);

    char ok[40];
    snprintf(ok, sizeof(ok), "[OK] sudut %d", deg);
    textReply(ok);
    return;
  }

  textReply("[ERROR] perintah tidak dikenal - ketik help");
}

// Feed raw bytes into a per-interface buffer, dispatch on ';' or newline.
// A completed line starting with '{' is JSON (the web app); anything else is a
// human at a Serial Monitor, so it goes to the text fallback.
void feed(String& buffer, char c, bool fromSerial) {
  if (c == ';' || c == '\n') {
    String line = buffer;
    line.trim();
    buffer = "";
    if (line.length() == 0) return;   // e.g. the '\n' after a ';' — ignore
    if (fromSerial) usbSeen = true;
    if (line[0] == '{') handleCommand(line);
    else                handleTextCommand(line);
  } else {
    buffer += c;
    // Overflow guard. Must fit the largest command: DISPLAY_BITMAP carries a full
    // 128x64 = 8192-char pixel string (+ JSON wrapper), so allow ~9000. Anything
    // bigger is genuinely malformed -> drop it.
    if (buffer.length() > 9000) buffer = "";
  }
}

// =================================================================== BLE
class ServerCallbacks : public NimBLEServerCallbacks {
  void onConnect(NimBLEServer* server) override {
    (void)server;
    bleConnected = true;
    lastRxMs = millis();
  }
  void onDisconnect(NimBLEServer* server) override {
    bleConnected = false;
    bleMtu = 23;
    stopAllActuators();          // failsafe on link loss
    watchdogArmed = false;       // disarm until the next HELLO (FIX 6)
    lastStatus = "Terputus";
    oledStatus("Terputus", "menunggu...");
    server->startAdvertising();  // allow reconnection
  }
  // FIX 5: capture the negotiated MTU so telemetry chunks correctly.
  void onMTUChange(uint16_t mtu, ble_gap_conn_desc* desc) override {
    (void)desc;
    bleMtu = mtu;
  }
};

class RxCallbacks : public NimBLECharacteristicCallbacks {
  void onWrite(NimBLECharacteristic* chr) override {
    std::string data = chr->getValue();
    for (char c : data) feed(bleBuffer, c, false);
  }
};

void setupBle() {
  NimBLEDevice::init(BLE_NAME);
  NimBLEDevice::setMTU(247);      // FIX 5: ask for a big MTU; peer negotiates down

  NimBLEServer* server = NimBLEDevice::createServer();
  server->setCallbacks(new ServerCallbacks());

  NimBLEService* service = server->createService(NUS_SERVICE_UUID);

  NimBLECharacteristic* rxChar = service->createCharacteristic(
    NUS_RX_CHAR_UUID,
    NIMBLE_PROPERTY::WRITE | NIMBLE_PROPERTY::WRITE_NR);
  rxChar->setCallbacks(new RxCallbacks());

  txChar = service->createCharacteristic(NUS_TX_CHAR_UUID, NIMBLE_PROPERTY::NOTIFY);

  service->start();

  NimBLEAdvertising* adv = NimBLEDevice::getAdvertising();
  adv->addServiceUUID(NUS_SERVICE_UUID);
  adv->setName(BLE_NAME);
  adv->start();
}

// =================================================================== SETUP
void setup() {
  Serial.begin(115200);

  // One coordinated allocator for servos + buzzer so no two share a timer (2 servos
  // + 1 buzzer = 3 of the 4 LEDC timers — fits; this is what stops the servo "singing").
  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);

  // Servos (ESP32Servo): 50 Hz, calibrated pulse range for SG90.
  servoL.setPeriodHertz(50);
  servoL.attach(PIN_SERVO_L, SERVO_MIN_US, SERVO_MAX_US);
  if (HAS_SERVO_R) {             // don't claim a timer for a servo that isn't there
    servoR.setPeriodHertz(50);
    servoR.attach(PIN_SERVO_R, SERVO_MIN_US, SERVO_MAX_US);
  }
  stopAllActuators();

