sudo-kachponz/robotku/firmware/robotku-esp32/src/main.cpp
  buzzerPwm.attachPin(PIN_BUZZER, 2000, 10);   // own LEDC timer via the allocator
  buzzerOff();

#if HAS_RGB
  pinMode(PIN_LED_R, OUTPUT);
  pinMode(PIN_LED_G, OUTPUT);
  pinMode(PIN_LED_B, OUTPUT);
  setLedColor(0, 0, 0);   // start dark
#endif

  // OLED
  Wire.begin(PIN_OLED_SDA, PIN_OLED_SCL);
  oledOk = oled.begin(SSD1306_SWITCHCAPVCC, OLED_ADDR);
  if (oledOk) oledSplash();

  startupTone();                  // "robot hidup" cue (delay() ok in setup)

  setupBle();

  oledStatus("Siap", "USB / Bluetooth");
}

// ==================================================================== LOOP
void loop() {
  // 1) Drain USB serial.
  while (Serial.available() > 0) feed(serialBuffer, (char)Serial.read(), true);

  // 2) Non-blocking motion deadline (FIX 3): stop when a timed move expires.
  if (motionEndsAtMs != 0 && (long)(millis() - motionEndsAtMs) >= 0) {
    stopAllActuators();           // also clears motionEndsAtMs
    lastStatus = "Selesai";
    oledStatus("Selesai", "menunggu perintah");
  }

  // 2b) Non-blocking buzzer deadline: silence the tone when its duration expires.
  if (buzzerOffMs != 0 && (long)(millis() - buzzerOffMs) >= 0) buzzerOff();

  // 3) Heartbeat watchdog (FIX 6): only after HELLO; trip once when link quiet.
  if (watchdogArmed && !failsafeEngaged &&
      (millis() - lastRxMs > HEARTBEAT_TIMEOUT_MS)) {
    stopAllActuators();
    failsafeEngaged = true;
    oledStatus("LINK PUTUS", "motor dimatikan");
    JsonDocument fs;
    fs["command"] = "FAILSAFE";
    fs["reason"] = "heartbeat_timeout";
    sendJson(fs);
  }

  // 4) Push a pending OLED frame, at most every OLED_MIN_PUSH_INTERVAL_MS (FIX:
  //    an SSD1306 refresh is ~30 ms of I2C; rendering per command would throttle
  //    the command stream itself).
  oledPushIfDue();
}
